package task11;

//Реализуйте приложение, которое имеет макет границы и надписи для каждой области в макете.
//
//События мыши для описания действий:
//
//a. Когда мышь входит в CENTER, программа показывает диалоговое окно (Добро пожаловать в [придумайте своё наименование]);
//
//b. Когда мышь входит в WEST, программа показывает диалоговое окно (Добро пожаловать в [придумайте своё наименование]);
//
//c. Когда мышь входит в SOUTH, программа показывает диалоговое окно (Добро пожаловать в [придумайте своё наименование]);
//
//d. Когда мышь входит в в NORTH, программа показывает диалоговое окно (Добро пожаловать в [придумайте своё наименование]);
//
//e. Когда мышь входит в EAST, программа показывает диалоговое окно (Добро пожаловать в [придумайте своё наименование]).

public class var2 {

}
